jQuery(document).ready(function () {	
       //利用canvas產生一個內含文字的圖檔
        function createMarkerIcon(text, opt) {
            //定義預設參數
            var defaultOptions = {
                fontStyle: "normal", //normal, bold, italic
                fontName: "Microsoft JhengHei",
                fontSize: 12, //以Pixel為單位
                bgColor: "darkblue",
                fgColor: "white",
                padding: 4,
                arrowHeight: 6 //下方尖角高度
            };
            options = $.extend(defaultOptions, opt);
            //建立Canvas，開始幹活兒
            var canvas = document.createElement("canvas"),
                context = canvas.getContext("2d");
            //評估文字尺寸
            var font = options.fontStyle + " " + options.fontSize + "px " + 
                       options.fontName;
            context.font = font;
            var metrics = context.measureText(text);
            //文字大小加上padding作為外部尺寸
            var w = metrics.width + options.padding * 2;
            //高度以Font的大小為準
            var h = options.fontSize + options.padding * 2 +
                    options.arrowHeight;
            canvas.width = w;
            canvas.height = h;
            //邊框及背景
            context.beginPath();
            context.rect(0, 0, w, h - options.arrowHeight);
            context.fillStyle = options.bgColor;
            context.fill();
            //畫出下方尖角
            context.beginPath();
            var x = w / 2, y = h, arwSz = options.arrowHeight;
            context.moveTo(x, y);
            context.lineTo(x - arwSz, y - arwSz);
            context.lineTo(x + arwSz, y - arwSz);
            context.lineTo(x, y);
            context.fill();
            //印出文字
            context.textAlign = "center";
            context.fillStyle = options.fgColor;
            context.font = font;
            context.fillText(text,
                w / 2,
                (h - options.arrowHeight) / 2 + options.padding);
            //傳回DataURI字串
            return canvas.toDataURL();
        }

        //計算兩個經緯座標間的距離(Haversine公式)
        function distHaversine(p1, p2) {
            var rad = function (x) { return x * Math.PI / 180; }
            var R = 6371; // earth's mean radius in km
            var dLat = rad(p2.lat() - p1.lat());
            var dLong = rad(p2.lng() - p1.lng());
            var a = Math.sin(dLat / 2) * Math.sin(dLat / 2) +
                    Math.cos(rad(p1.lat())) * Math.cos(rad(p2.lat()))
                    * Math.sin(dLong / 2) * Math.sin(dLong / 2);
            var c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a));
            var d = R * c;
            return parseFloat(d.toFixed(3));
        }
        //資料陣列
        var branches = [];
        //取得資料(含經緯座標)，存為物作陣列
        var list =
			"一太e衛浴觀光工廠,(02)24342111,基隆市安樂區大武崙工業區武訓街51號,25.147263,121.699609\n" +
			"三峽農特產文化館,(02)26723868,台北縣三峽鎮正義街18號,24.919348,121.369459\n" +
			"大黑松小倆口牛軋糖創意博物館,(02)22687222,新北市土城區自強街31-2號,24.97193,121.432732\n" +
			"工研益壽多文化館,(02)27781981,新北市淡水區行忠路168號,25.19967,121.45515\n" +
			"手信坊創意和菓子文化館,(02)82620506,新北市土城區國際路55號,24.977821,121.466603\n" +
			"玉美人孕婦裝觀光工廠,(02)89669762,新北市板橋區四川路2段16巷10號5樓,24.997297,121.456266\n" +
			"光淙金工藝術館,(02)86014430,新北市林口區粉寮路一段104號,25.081926,121.400113\n" +
			"宏洲磁磚觀光工廠,(02)86782788,新北市鶯歌區中正三路230巷16號,24.939779,121.329963\n" +
			"琉傳天下藝術館,(02)26256972,新北市淡水區忠寮里口湖子1-7號,25.190622,121.477751\n" +
			"茶山房肥皂文化體驗館,(02)26714400,新北市三峽區白雞路64-11號,24.912374,121.384082\n" +
			"許新旺陶瓷紀念博物館,(02)26789571,新北市鶯歌區尖山埔路81號,24.950898,121.347805\n" +
			"幾分甜幸福城堡,(02)22902222,新北市五股區五工六路24號,25.063311,121.448758\n" +
			"登峰魚丸博物館,(02)26253312,新北市淡水區中正東路一段3巷43號8樓,25.170097,121.439716\n" +
			"維格餅家 鳳梨酥夢工場,(02)22919131,新北市五股區成泰路一段87號,25.068739,121.435211\n" +
			"台灣不二衛生套知識館,(02)37655005,新北市淡水區行忠路132號,25.198772,121.45483\n" +
			"吳福洋襪子故事館,(02)26035008,新北市林口區工二工業區工九路3號,25.075814,121.401296\n" +
			"王鼎時間科藝體驗館,(02)22682999,新北市土城區大暖路136號,24.955976,121.423672\n" +
			"中天健康生活館,(03)4710888,桃園縣龍潭鄉高楊北路81號,24.839645,121.20659\n" +
			"白木屋品牌探索館,(03)4965757 ,桃園縣楊梅鎮高獅路813巷22弄6號,24.927715,121.164381\n" +
			"巧克力共和國,(03)3656555 ,桃園縣八德市建國路386號,24.943325,121.297187\n" +
			"東和音樂體驗館,(03)3882215#210,桃園縣大溪鎮信義路226號,24.886028,121.29493\n" +
			"卡司．蒂菈樂園,(03)2551999,桃園縣蘆竹鄉大竹北路90-66號,25.031860,121.253461\n" +
			"郭元益糕餅博物館,(03)4962201#1,桃園縣楊梅鎮幼獅工業區青年路9巷1號,24.928066,121.167525\n" +
			"雅聞魅力博覽館,(03)4883800 ,桃園縣楊梅鎮中山北路1段21巷1號,24.907143,121.149866\n" +
			"義美生產生態生活廠區,(03)3117525,桃園縣蘆竹鄉南工路一段11號,25.059509,121.278636\n" +
			"麗嬰房采衣館,(03)3544417,桃園縣蘆竹鄉海湖村海山中街8號,25.106695,121.260003\n" +
			"臺灣菸酒(股)公司 桃園觀光酒廠,(03)3283001,桃園縣龜山鄉文化一路55號,25.056168,121.375231\n" +
			"江記豆腐乳文化館,(03)4986018,桃園縣中壢市月眉路2段248巷85號,25.006634,121.185164\n" +
			"祥儀機器人夢工廠 未來館,(03)3623452,桃園縣桃園市桃鶯路461號,24.282689,121.192685\n" +
			"老K舒眠文化館,(03)4205050,桃園縣新屋鄉梅高路3段97號,24.9538151,121.1446661\n" +
			"南僑桃園觀光體驗工廠,(03)2630264,桃園縣龜山鄉龜山工業區興邦路35號,24.983481,121.32509\n" +
			"大溪老茶廠,(03)3825089,桃園市大溪區復興路二段732巷80號,24.8306742,121.327455\n" +
			"太平洋自行車博物館,(03)4861231,桃園市新屋區永安里永福路686號,24.986481,121.029649\n" +
			"GFun機能服飾紡織生活館,(0800)038038,桃園市觀音工業區工業六路3號,25.0482939,121.1147143\n" +
			"源友咖啡文化園區,(03)4697387,桃園市平鎮區工業五路8號,24.9022939,121.1959753\n" +
			"春池綠能玻璃觀光工廠,(03)5389165,新竹市香山區牛埔南路372號,24.794325,120.932484\n" +
			"濟生Beauty兩岸觀光生醫美學健康館,(0800)213568,新竹縣湖口鄉新竹工業區實踐路3號,24.869832,121.018234\n" +
			"冠軍綠概念館,(037)561761,苗栗縣造橋鄉豐湖村一鄰乳姑山2號,24.625004,120.852795\n" +
			"臺鹽通霄觀光園區,(037)792121#825,苗栗縣通霄鎮內島里122號,24.55635,120.704201\n" +
			"百茶文化園區觀光工廠,(037)252667,苗栗縣頭屋鄉象山路188號,24.578122,120.858018\n" +
			"立康健康養生觀光工廠,(037)629888,苗栗縣頭份鎮工業路55號,24.674084,120.885692\n" +
			"竹南啤酒觀光工廠,(037)583001,苗栗縣竹南鎮和興路345號,24.711947,120.877547\n" +
			"四方鮮乳酪故事館,(037)472609,苗栗縣竹南鎮大厝里9鄰59-12號,24.6792761,120.8726643\n" +
			"台灣氣球博物館,(04)25284525,台中市神岡區大豐路5段505號,24.247356,120.699081\n" +
			"台灣味噌釀造文化館,(04)25320279,台中縣豐原市三村里西勢路701號,24.234156,120.700602\n" +
			"張連昌薩克斯風博物館,(04)25562363,台中市后里區公安路330-1號,24.312397,120.694792\n" +
			"順天堂觀光工廠,(04)23594848#280,台中市工業區42路16號,24.173201,120.584355\n" +
			"鞋寶觀光工廠,(04)23590112#116,台中市西屯區工業區八路11號,24.171961,120.603991\n" +
			"寶熊漁樂館,(04)35013338,台中市潭子區中山路三段11號,24.220182,120.706291\n" +
			"臺灣菸酒(股)公司台中觀光酒廠,(04)23501318#430,台中市西屯區工業28路2號,24.164551,120.598778\n" +
			"老樹根魔法木工坊,(04)22628621,台中市南區樹義路63號,24.10984,120.652757\n" +
			"阿聰師芋頭文化館,(04)26713077,台中市大安區福興里興安路168號,24.350889,120.612373\n" +
			"台灣印刷探索館,(04)24951001,臺中市大里區中興路一段288號,24.087157,120.696514\n" +
			"烏日啤酒觀光工廠,(04)23381216 ,台中市烏日區光華街1號,24.1108649,120.6196427\n" +
			"中興穀堡稻米博物館,(04)8926088 ,彰化縣埤頭鄉彰水路二段526號,23.870175,120.459213\n" +
			"台灣玻璃館,(04)7811299,彰化縣鹿港鎮鹿工南四路30號,24.068678,120.395063\n" +
			"白蘭氏健康博物館,(04)7810077,彰化縣鹿港鎮鹿工路18號,24.077666,120.400452\n" +
			"襪仔王觀光工廠,(04)8749909#12,彰化縣田中鎮頂潭里員集路三段440巷16弄1號,23.874718,120.587495\n" +
			"樂活觀光襪廠,(04)8720522,彰化縣社頭鄉廣興村中山路一段465號,23.895039,120.583244\n" +
			"緞帶王觀光工廠,(04)7813366,彰化縣鹿港鎮鹿工路15號,24.076936,120.395178\n" +
			"台灣優格餅乾學院,(04)7589501,彰化縣線西鄉草豐路501巷5號,24.125857,120.46646\n" +
			"華新MASK創意生活館,(0800)752116,彰化縣田中鎮中州路二段751號,23.847049,120.569501\n" +
			"丸莊醬油觀光工廠,(05)5863666,雲林縣西螺鎮延平路25號,23.802355,120.463728\n" +
			"大同醬油黑金釀造館,(05)5576899,雲林縣斗六市斗工二路39號,23.719425,120.597991\n" +
			"汎歌保養品科技美學舘,(05)5571138,雲林縣斗六市工業路79號,23.722006,120.58921\n" +
			"朝露魚舖觀光工廠,(05)5575989,雲林縣斗六市斗工六路六號,23.71793,120.596065\n" +
			"源順芝麻觀光油廠,(05)6622574,雲林縣土庫鎮成功路1-62號,23.672256,120.395321\n" +
			"福祿壽觀光酒廠,(05)5823106,雲林縣古坑鄉中山路11號,23.640332,120.560153\n" +
			"緹諾時尚生活館,(080)528888,雲林縣斗六市斗工六路20號,23.717701,120.595582\n" +
			"興隆毛巾觀光工廠,(05)6226008,雲林縣虎尾鎮埒內里84-1號,23.725125,120.443386\n" +
			"台灣鯛生態創意園區,(05)7993996,雲林縣口湖鄉崙東村民生路1-88號,23.608000,120.172125\n" +
			"良作工場農業文創館,(05)5529586,雲林縣大埤鄉豐田工業區豐田路57號,23.639488,120.467220\n" +
			"水里蛇窯陶藝文化園區,(049)2770967,南投縣水里鄉頂崁村水信路一段512巷21號,23.801734,120.865386\n" +
			"台灣麻糬主題館,(049)2261123,南投縣南投市自強三路三號,23.921423,120.668698\n" +
			"光遠燈籠觀光工廠,(049)2642394,南投縣竹山鎮延平二路11號,23.975693,120.938331\n" +
			"旺根城-藏傘閣觀光工廠,(049)2643411,南投縣竹山鎮延平一路12號,23.768816,120.704195\n" +
			"采棉居寢飾文化舘,(049)2642166,南投縣竹山鎮延平一路12號,23.768816,120.704195\n" +
			"香里活力豬品牌文化館,(049)2259999#204,南投市仁和路3號,23.924255,120.675292\n" +
			"造紙龍手創館,(049)2902989,南投縣埔里鎮溪南里隆生路118-2號,23.948082,120.958257\n" +
			"遊山茶訪,(049)2643919,南投縣竹山鎮工業區延平路19號,23.768524,120.702479\n" +
			"廣興紙寮,(049)2913037 ,南投縣埔里鎮鐵山里鐵山路310號,23.975693,120.938331\n" +
			"臺灣菸酒(股)公司埔里觀光酒廠,(049)2984006,南投縣埔里鎮中山路3段219號,23.967921,120.9602\n" +
			"臺灣菸酒(股)公司南投觀光酒廠,(049)2234171,南投市軍功里東山路82號,23.919663,120.705511\n" +
			"卡普秀醫美研發中心,(05)2215565,嘉義縣民雄工業區成功五街3號,23.523299,120.450156\n" +
			"民雄金桔觀光工廠,(05)2720351,嘉義縣民雄鄉三興村38號,23.558153,120.476685\n" +
			"板陶窯交趾剪黏工藝園區,(05)7810832,嘉義縣新港鄉板頭村42-3號,23.565285,120.32072\n" +
			"臺灣菸酒(股)有限公司嘉義觀光酒廠,(05)2215721 ,嘉義縣民雄鄉民雄工業區中山路3號,23.521073,120.444035\n" +
			"余順豐花生觀光工廠,(05)3660605,嘉義縣東石鄉蔦松村湖底路20之28號,23.466447,120.222949\n" +
			"梅問屋梅子元氣館,(0800)606060,嘉義縣梅山鄉中山路527號,23.58681,120.550878\n" +
			"永勝小丸子健康工廠,(05)2214212,嘉義縣民雄鄉頭橋工業區工業三路6-3號,23.520926,120.436623\n" +
			"月桃故事館,(05)2766399,嘉義市保忠一街359號,23.512761,120.450046\n" +
			"卡羅爾銅管樂器觀光工廠,(05)2953688,嘉義縣大林鎮大埔美園區二十路3號,23.5825193,120.5023969\n" +
			"Sonispa漾魅力音波體驗館,(0800)892889,臺南市安南區科技一路8號,23.043049,120.152529\n" +
			"臺南．家具產業博物館,(06)2661193,台南市仁德區二仁路一段315巷50號,22.923936,120.222481\n" +
			"立康中草藥產業文化館,(06)2032225,台南市永康區環工路29號,23.045952,120.274381\n" +
			"台灣金屬創意館,(06)2030728,台南市永康區永科環路598號,23.045063,120.275724\n" +
			"和明織品文化館,(06)7875288,台南市七股區大埕里大埕189號,23.146314,120.145663\n" +
			"港香蘭綠色健康知識館,(06)505)2505,台南市新市區南科一路1號,23.093616,120.284752\n" +
			"TJCOS台鉅美妝觀光工廠,(06)2052013,台南市仁德區中正路三段587號,22.988590,120.257096\n" +
			"臺灣菸酒(股)公司隆田觀光酒廠,(06)5791311#521,台南市官田區中華路一段 335號,23.195744,120.321194\n" +
			"黑橋牌香腸博物館,(06)2616990#12,台南市南區新忠路2號,22.979627,120.184633\n" +
			"康那香不織布創意王國,(06)7941573,台南市將軍區三吉里66之1號,23.2020367,120.1129398\n" +
			"新百祿燕窩觀光工廠,(06)2615959,台南市新和路40號,22.967492,120.176311\n" +
			"麗豐微酵館,(0800)882789,台南市官田區二鎮里工業路48號,23.216738,120.323039\n" +
			"瓜瓜園地瓜生態故事館,(06)5902966,台南市新化區中正路127巷31號,23.027205,120.306934\n" +
			"天一中藥生活化園區,(06)6985978#128,台南市官田區二鎮村工業路31號,23.213129,120.323081\n" +
			"台灣漢藥體驗學習館,(06)7220646,台南市佳里區嘉福里115-1號,23.168592,120.149568\n" +
			"臺灣菸酒公司善化啤酒觀光工廠,(06)5838511#431,台南市善化區成功路2號,23.129922,120.318478\n" +
			"虹泰水凝膠世界,(06)2724880,台南市仁德區中正路三段523巷116號,22.974768,120.253053\n" +
			"卡多利亞良食故事館,(06)6873480,台南市後壁區後壁里42-27號,23.359434,120.358808\n" +
			"紅崴觀光工廠,(06)2380713,台南市安南區工業一路23號,23.0419629,120.1511299\n" +
			"美雅家具觀光工廠,(06)6817456,台南市白河區甘宅里101-1號,23.382586, 120.433107\n" +
			"東和蜂文化觀光工廠,(06)6800773,台南市東山區東正里東勢1-18號,23.318299,120.407817\n" +
			"華美光學eye玩視界,(06)5937597#6802,台南市安定區中沙里沙崙30號,23.073565,120.210869\n" +
			"國王家族羽絨服飾觀光工廠,(06)7213380,台南市佳里區民安里同安寮2-8號,23.1619041,120.1854979\n" +
			"台灣滷味博物館,(07)6229100,高雄縣岡山鎮本工一路25號,22.817577,120.267411\n" +
			"珍芳烏魚子見學工廠,(07)8227488,高雄市前鎮區新衙路296巷81弄13號,22.582711,120.312968\n" +
			"彪琥台灣鞋故事館,(07)3892246  ,高雄市三民區民族一路335巷43-1號,22.65377,120.313272\n" +
			"富樂夢橡皮擦觀光工廠,(07)6996173,高雄市湖內區中山路二段42號,22.9045705,120.2280261\n" +
			"萬寶祿酵素品牌文化館,(08)7624988,屏東縣長治鄉德和村神農路17號,22.718332,120.538419\n" +
			"臺灣菸酒(股)公司屏東觀光酒廠,(08)7781640#448,屏東縣內埔工業區豐田村建國路34號,22.645428,120.549485\n" +
			"鮮饌道海洋食品文化館,(08)8752229,屏東縣林邊鄉成功路122號,22.431677,120.495504\n" +
			"天明製藥農科觀光藥廠,(08)7629666,屏東縣長治鄉德和村神農路3號,22.713619,120.53681\n" +
			"池上鄉農會觀光工廠金色豐收館,(089)862643,台東縣池上鄉新興村85之6號,23.112151,121.203068\n" +
			"香又香便當調查局,(03)8228111,花蓮縣花蓮市美工路15號,24.014188,121.632084\n" +
			"台灣菸酒(股)公司花蓮觀光酒廠,(03)8222130,花蓮市美工路六號,24.016436,121.633548\n" +
			"亞典蛋糕密碼館,(03)9286777 ,宜蘭縣宜蘭市梅洲二路122號,24.781009,121.731635\n" +
			"宜蘭餅發明館,(03)9905999,宜蘭縣蘇澳鎮海山西路369號,24.779943,121.736927\n" +
			"金車噶瑪蘭威士忌酒廠,(03)9229000,宜蘭縣員山鄉員山路二段326號,24.713691,121.69179\n" +
			"博士鴨觀光工廠,(03)9606051,宜蘭縣五結鄉福興村新五路1-1號,24.682497,121.785123\n" +
			"菌寶貝博物館,(03)9281168,宜蘭市梅洲一路22號,24.776214,121.735223\n" +
			"臺灣菸酒(股)公司宜蘭酒廠觀光工廠,(03)935)5526,宜蘭市舊城西路3號,24.75695,121.749523\n" +
			"橘之鄉蜜餞觀光工廠,(03)9285758 ,宜蘭市梅洲二路33號,24.779943,121.736927\n" +
			"台灣足鞋健康知識館,(03)9500551,宜蘭縣五結鄉中里路18號,24.6938083,121.7735359\n" +
			"陳金福號貢糖觀光工廠,(082)321414,金門縣金城鎮伯玉路一段90號,24.432624,118.3220544" ;
		var lines = list.replace(/\r/g, "").split('\n');

		for (var i = 0; i < lines.length; i++) {
			var parts = lines[i].split(',');
			branches.push({
			name: parts[0],
			tel: parts[1],
			addr: parts[2],
			latlng: new google.maps.LatLng(
						parseFloat(parts[3]), parseFloat(parts[4])),
			dist: 0
			});
		}
		getGeolocation();

        //取得使用者目前位罝
        function getGeolocation() {
            if (navigator && navigator.geolocation) {
                //getCurrentPosition屬非同步執行，要另定函數解析結果
                navigator.geolocation.getCurrentPosition(parsePosition);
            }
        }
        //解析getCurrentPosition傳回的結果
        function parsePosition(pos) {
            //標示點陣列
            var markers = [];
            //由pos.coords取出latitude及longitude
            var curLatLng = new google.maps.LatLng(
                    pos.coords.latitude, pos.coords.longitude);
            //分別計算對所有Branch的距離
            for (var i = 0; i < branches.length; i++) {
                var branch = branches[i];
                branch.distance = //計算兩個LatLng間的距離
                        distHaversine(branch.latlng, curLatLng);
            }
            //依距離進行排序
            branches.sort(function (a, b) {
                if (a.distance == b.distance) return 0;
                return (a.distance > b.distance) ? 1 : -1;
            });
            //設定地圖參數
            var mapOptions = {
                center: curLatLng,
                mapTypeId: google.maps.MapTypeId.ROADMAP //正常2D道路模式
            };
            //在指定DOM元素中嵌入地圖
            var map = new google.maps.Map(
                    document.getElementById("map_canvas"), mapOptions);
            //使用LatLngBounds統計檢視範圍
            var bounds = new google.maps.LatLngBounds();
            //加入使用者所在位置
            var marker = new google.maps.Marker({
                position: curLatLng,
                title: "現在位置",
                //借用前篇文章介紹的Canvas.toDataURL()產生動態圖檔作為圖示
                icon: createMarkerIcon("現在位置"),
                map: map
            });
			bounds.extend(curLatLng);
            //因為已排序過，故會依距離由近到遠加入Marker
            for (var i = 0; i < branches.length; i++) {
                var b = branches[i];
                //距離最近的前三名加入檢視範圍
                if (i < 3) bounds.extend(b.latlng);
                var marker = new google.maps.Marker({
                    position: b.latlng,
                    title: b.name, //名稱告示牌作為圖示
                    icon: createMarkerIcon(b.name,
                            //距離較近的前三名為紅底，其餘為暗紅底
                            { bgColor: i < 3 ? 'red' : 'darkred' }),
                    map: map
                });
				if(i==0) {
					document.all.zero.innerHTML= "<a href='info.html'>" + b.name +"</a>";
					document.all.zero_in.innerHTML="<p>地址 <br> "+b.addr+"<p>電話 <br>"+b.tel;
				}
				if(i==1) {
					document.all.one.innerHTML= "<a href='info.html'>" + b.name +"</a>";
					document.all.one_in.innerHTML="<p>地址 <br> "+b.addr+"<p>電話 <br>"+b.tel;
				}
				if(i==2) {
					document.all.two.innerHTML= "<a href='info.html'>" + b.name +"</a>";
					document.all.two_in.innerHTML="<p>地址 <br>"+b.addr+"<p>電話 <br>"+b.tel;
				}
            }
            //調整檢視範圍
            map.fitBounds(bounds);
        }
    });